Revit 2018 API
UIApplication.OpenAndActivateDocument Method
Overload List
Name | Description
OpenAndActivateDocument(String)
 Opens and activates a Revit document.
OpenAndActivateDocument(ModelPath, OpenOptions, Boolean)
 Opens and activates a Revit document.
See Also
UIApplication Class
UIApplication Members
Autodesk.Revit.UI Namespace